//Задача 5
//Параметризированный класс – Вектор
//Адаптер контейнера - стек.
//Задание 3
//Найти максимальный элемент и добавить его в начало контейнера
//Задание 4
//Найти минимальный элемент и удалить его из  контейнера	
//Задание 5
//К каждому элементу добавить среднее арифметическое контейнера


//Задача 5
//1.	Создать параметризированный класс, используя в качестве контейнера адаптер контейнера.
//2.	Заполнить его элементами.
//3.	Добавить элементы в соответствии с заданием
//4.	Удалить элементы в соответствии с заданием.
//5.	Выполнить задание варианта для полученного контейнера.
//6.	Выполнение всех заданий оформить в виде методов параметризированного класса.

#include <C:\Users\serge\OneDrive\Документы\GitHub\Tarasov_Sergey_LABS_PSTU_RIS_22_1b\class_laba11\task2\time.h> 
#include <C:\Users\serge\OneDrive\Документы\GitHub\Tarasov_Sergey_LABS_PSTU_RIS_22_1b\class_laba11\task2\time.cpp> 
#include <iostream>
#include <stack> 
#include <vector>
#include "vector.h"
using namespace std;

void  main()
{
	Vector<Time>v(3);
	v.Print();
	cout << endl;
	v.Add();
	v.Print();
	cout << endl;
	v.Del();
	v.Print();
	cout << endl;
	Time e;
	e = v.Srednee();
	v.Add_sred(e);
	v.Print();
	cout << endl;
}